AutoTrader/app/api/car_world_trader/v1/cars.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                route_param :id do
                    get do
                        puts "Un solo carro ID: #{params[:id]}"
                        Car.find(params[:id])

INSERT INTO "cars" ("manufacturer", "design", "style", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["manufacturer", "Toyota"], ["design", "Sedan"], ["style", "Sport"], ["created_at", "2023-07-13 17:04:08.899325"], ["updated_at", "2023-07-13 17:04:08.899325"]]
---
                    end
                end
                post do
                    Car.create!(params[:car])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "manufacturer" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["manufacturer", "Toyota aveo"], ["updated_at", "2023-07-13 17:29:12.822576"], ["id", 2]]
---
                    requires :car, type: Hash, desc: "Carro Update"
                end
                put ':id' do
                    car = Car.find(params[:id])
                    car.update(params[:car])

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                    requires :id, type: Integer, desc: "Status id"
                end
                delete ':id' do
                    Car.find(params[:id]).destroy