pokeAuth/app/api/pokedex_auth/base.rb

      def authenticate_user!
        token_regex = /Bearer (\w+)/
        if headers['Authorization'].present? && headers['Authorization'].match(token_regex)
          token = headers['Authorization'].match(token_regex)[1]
          if (user = User.find_by_auth_token(token))
---
SELECT `users`.* FROM `users` WHERE `users`.`auth_token` = '83f51d3c3c3d48e92889be1cb03f6084' LIMIT 1