pokeAuth/app/services/pokemon_find_service.rb

  def self.find(search_value)
    res = {}
    serializer_options = {}
    serializer_options[:each_serializer] = PokemonSerializer
    serializer_options[:only] = true

    if search_value.is_a?(Integer)
      res[:pokemon] = ActiveModelSerializers::SerializableResource.new(Pokemon.find(search_value), serializer_options)
    else
      poke_find = Pokemon.find_by(name: search_value)
---
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`id` = 1 LIMIT 1
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`name` = 'Bulbasaur' LIMIT 1