pokeAuth/app/services/pokemon_create_service.rb

INSERT INTO `pokemons` (`num`, `name`, `type1`, `type2`, `total`, `hp`, `attack`, `defense`, `sp_atk`, `sp_def`, `speed`, `generation`, `legendary`, `created_at`, `updated_at`) VALUES (NULL, 'ClaudiaP', 'amazonas', NULL, NULL, NULL, 987, 378, NULL, NULL, NULL, NULL, NULL, '2023-09-08 23:28:04.274496', '2023-09-08 23:28:04.274496')
---
  def self.create(params)
    return unless PokemonFindService.find(params [:name]).empty?

    new_poke = Pokemon.new({
      name: params[:name],
      type1: params[:type1],
      attack: params[:attack],
      defense: params[:defense]
    })
    if new_poke.save