mi_app/app/controllers/books_controller.rb

INSERT INTO "books" ("tile", "author", "pages_count", "comments", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["tile", "test"], ["author", "test"], ["pages_count", 98], ["comments", "ddpopodp"], ["isbn", "9898"], ["created_at", "2023-09-27 21:29:30.773229"], ["updated_at", "2023-09-27 21:29:30.773229"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save