mi_app/app/controllers/test_controller.rb

  def hola
    puts "Hola pues LEO PUTS"
    @mi_variable = 'Hola pues mi LEO'
    @pets = Pet.all
---
SELECT "pets".* FROM "pets" ORDER BY "pets"."id" ASC LIMIT ?  [["LIMIT", 1]]