app_jwt/app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers['Authorization']
    return render json: { error: 'unauthorized_sin_JWT' }, status: :unauthorized if header.nil?

    header = header.split(' ').last
    decoded = jwt_decode(header)
    unless decoded
      render json: { error: 'unauthorized_sin_decoded' }, status: :unauthorized
      return
    end
    @current_user = User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]