app_jwt/app/controllers/users_controller.rb

  def show
    puts "show params = #{params.inspect}"
    puts "show request = #{request.headers}"
    request.headers.each do |key, value|
      puts "key = #{key}, value = #{value}"
    end
    puts "boby = #{request.body.read}"
    user = User.find_by(username: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "leo"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def find_user
    User.find_by(username: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "leo"], ["LIMIT", 1]]